  ### Deployment Results ✅

  **jcetina** successfully deployed branch `jcetina/bastion-vault` to **production**

  <details><summary>Show Results</summary>

  ```terraform
[command]/home/runner/work/_temp/2b4216be-023d-4c77-ba74-1237d1ee9e28/terraform-bin apply -no-color -auto-approve -compact-warnings

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

# azurerm_key_vault_key.bastion_ssh_key will be created
+ resource "azurerm_key_vault_key" "bastion_ssh_key" {
    + curve              = (known after apply)
    + e                  = (known after apply)
    + id                 = (known after apply)
    + key_opts           = [
        + "decrypt",
        + "encrypt",
        + "sign",
        + "verify",
      ]
    + key_size           = 2048
    + key_type           = "RSA"
    + key_vault_id       = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.KeyVault/vaults/bastion-vault-9c07ae1c"
    + n                  = (known after apply)
    + name               = "bastion-ssh-key"
    + public_key_openssh = (known after apply)
    + public_key_pem     = (known after apply)
    + version            = (known after apply)
    + versionless_id     = (known after apply)
    + x                  = (known after apply)
    + y                  = (known after apply)
  }

# azurerm_linux_virtual_machine.servers[0] will be created
+ resource "azurerm_linux_virtual_machine" "servers" {
    + admin_username                  = "adminuser"
    + allow_extension_operations      = true
    + computer_name                   = (known after apply)
    + disable_password_authentication = true
    + extensions_time_budget          = "PT1H30M"
    + id                              = (known after apply)
    + location                        = "eastus"
    + max_bid_price                   = -1
    + name                            = "server-0"
    + network_interface_ids           = [
        + "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkInterfaces/server-nic-0",
      ]
    + patch_mode                      = "ImageDefault"
    + platform_fault_domain           = -1
    + priority                        = "Regular"
    + private_ip_address              = (known after apply)
    + private_ip_addresses            = (known after apply)
    + provision_vm_agent              = true
    + public_ip_address               = (known after apply)
    + public_ip_addresses             = (known after apply)
    + resource_group_name             = "org-jcetina-repo-baklava-rg"
    + size                            = "Standard_F2"
    + virtual_machine_id              = (known after apply)

    + admin_ssh_key {
        + public_key = (known after apply)
        + username   = "adminuser"
      }

    + os_disk {
        + caching                   = "ReadWrite"
        + disk_size_gb              = (known after apply)
        + name                      = (known after apply)
        + storage_account_type      = "Standard_LRS"
        + write_accelerator_enabled = false
      }

    + source_image_reference {
        + offer     = "0001-com-ubuntu-server-focal"
        + publisher = "Canonical"
        + sku       = "20_04-lts"
        + version   = "latest"
      }

    + termination_notification {
        + enabled = (known after apply)
        + timeout = (known after apply)
      }
  }

# azurerm_linux_virtual_machine.servers[1] will be created
+ resource "azurerm_linux_virtual_machine" "servers" {
    + admin_username                  = "adminuser"
    + allow_extension_operations      = true
    + computer_name                   = (known after apply)
    + disable_password_authentication = true
    + extensions_time_budget          = "PT1H30M"
    + id                              = (known after apply)
    + location                        = "eastus"
    + max_bid_price                   = -1
    + name                            = "server-1"
    + network_interface_ids           = [
        + "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkInterfaces/server-nic-1",
      ]
    + patch_mode                      = "ImageDefault"
    + platform_fault_domain           = -1
    + priority                        = "Regular"
    + private_ip_address              = (known after apply)
    + private_ip_addresses            = (known after apply)
    + provision_vm_agent              = true
    + public_ip_address               = (known after apply)
    + public_ip_addresses             = (known after apply)
    + resource_group_name             = "org-jcetina-repo-baklava-rg"
    + size                            = "Standard_F2"
    + virtual_machine_id              = (known after apply)

    + admin_ssh_key {
        + public_key = (known after apply)
        + username   = "adminuser"
      }

    + os_disk {
        + caching                   = "ReadWrite"
        + disk_size_gb              = (known after apply)
        + name                      = (known after apply)
        + storage_account_type      = "Standard_LRS"
        + write_accelerator_enabled = false
      }

    + source_image_reference {
        + offer     = "0001-com-ubuntu-server-focal"
        + publisher = "Canonical"
        + sku       = "20_04-lts"
        + version   = "latest"
      }

    + termination_notification {
        + enabled = (known after apply)
        + timeout = (known after apply)
      }
  }

Plan: 3 to add, 0 to change, 0 to destroy.
azurerm_key_vault_key.bastion_ssh_key: Creating...
azurerm_key_vault_key.bastion_ssh_key: Still creating... [10s elapsed]
azurerm_key_vault_key.bastion_ssh_key: Still creating... [20s elapsed]
azurerm_key_vault_key.bastion_ssh_key: Still creating... [30s elapsed]
azurerm_key_vault_key.bastion_ssh_key: Still creating... [40s elapsed]
azurerm_key_vault_key.bastion_ssh_key: Still creating... [50s elapsed]
azurerm_key_vault_key.bastion_ssh_key: Still creating... [1m0s elapsed]
azurerm_key_vault_key.bastion_ssh_key: Still creating... [1m10s elapsed]
azurerm_key_vault_key.bastion_ssh_key: Still creating... [1m20s elapsed]
azurerm_key_vault_key.bastion_ssh_key: Still creating... [1m30s elapsed]
azurerm_key_vault_key.bastion_ssh_key: Still creating... [1m40s elapsed]
azurerm_key_vault_key.bastion_ssh_key: Still creating... [1m50s elapsed]
azurerm_key_vault_key.bastion_ssh_key: Still creating... [2m0s elapsed]
azurerm_key_vault_key.bastion_ssh_key: Creation complete after 2m6s [id=https://bastion-vault-9c07ae1c.vault.azure.net/keys/bastion-ssh-key/9d00c11923f54de0b33048b15dacf3ad]
azurerm_linux_virtual_machine.servers[1]: Creating...
azurerm_linux_virtual_machine.servers[0]: Creating...
azurerm_linux_virtual_machine.servers[1]: Still creating... [10s elapsed]
azurerm_linux_virtual_machine.servers[0]: Still creating... [10s elapsed]
azurerm_linux_virtual_machine.servers[1]: Still creating... [20s elapsed]
azurerm_linux_virtual_machine.servers[0]: Still creating... [20s elapsed]
azurerm_linux_virtual_machine.servers[1]: Still creating... [30s elapsed]
azurerm_linux_virtual_machine.servers[0]: Still creating... [30s elapsed]
azurerm_linux_virtual_machine.servers[1]: Still creating... [40s elapsed]
azurerm_linux_virtual_machine.servers[0]: Still creating... [40s elapsed]
azurerm_linux_virtual_machine.servers[1]: Still creating... [50s elapsed]
azurerm_linux_virtual_machine.servers[0]: Still creating... [50s elapsed]
azurerm_linux_virtual_machine.servers[1]: Still creating... [1m0s elapsed]
azurerm_linux_virtual_machine.servers[0]: Still creating... [1m0s elapsed]
azurerm_linux_virtual_machine.servers[1]: Still creating... [1m10s elapsed]
azurerm_linux_virtual_machine.servers[0]: Still creating... [1m10s elapsed]
azurerm_linux_virtual_machine.servers[0]: Creation complete after 1m17s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Compute/virtualMachines/server-0]
azurerm_linux_virtual_machine.servers[1]: Creation complete after 1m17s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Compute/virtualMachines/server-1]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.
```

  </details>